<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">DML</h1>

<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<br>
<p style="text-align:justify; font-size:25px">DML stands for "Data Manipulation Language" and it is a subset of SQL (Structured Query Language) that is used for manipulating data stored in a relational database. <br>DML is responsible for performing operations on the data itself, such as inserting, updating, and deleting records. </p>
<br><br>
Types of Sql Commands<br>
<br><img style="display: block;margin-left: auto;margin-right: auto;width: 60%; " src="./sql_images/commands_type.jpg">
</div>

In [1]:
import mysql.connector

db = mysql.connector.connect(
    
    host="localhost",
    port=3307,
    user="root",
    password="",

)

In [74]:
db.connect()

In [75]:
cursor = db.cursor()

In [4]:
# create a new database
cursor.execute("CREATE DATABASE mydb")

In [6]:
# create a table
query = """
CREATE TABLE mydb.users(
    username VARCHAR(255) UNIQUE,
    user_id INTEGER PRIMARY KEY AUTO_INCREMENT,
    age INTEGER,

    study VARCHAR(255) DEFAULT NULL,
    semister INTEGER DEFAULT NULL,

    CONSTRAINT uage CHECK (age >= 16 AND age <= 30)
)

"""
cursor.execute(query)

In [7]:
# create a function for show column and values
def show_data():
    
    cursor.execute("SHOW COLUMNS FROM mydb.users")
    col = [i[0] for i in cursor.fetchall()]
    
    cursor.execute("SELECT * FROM mydb.users")
    row = [i for i in cursor.fetchall()]
    
    for i in row:
        for k,v in list(zip(col,i)):
            print(k,":",v)
        print()
    

# truncate function

def clear_data():
    cursor.execute("TRUNCATE TABLE mydb.users")

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">INSERT</h1>

<div style="text-align:left; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<br>
<h3 style="color:#005bbd; font-size:25px;">Insert Values
</h3><br>
<h3 style="color:red; font-size:25px;">INSERT INTO name (columns..) VALUES (values..)</h3>

In [17]:
query = """
    INSERT INTO mydb.users (username,age,study,semister)
    VALUES ('usr1@xyz',16,'CS',3)
"""
cursor.execute(query)

In [18]:
show_data()

username : usr1@xyz
user_id : 1
age : 16
study : CS
semister : 3

<div style="text-align:left; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<br>
<h3 style="color:#005bbd; font-size:25px;">Insert Specfic Values
</h3><br>
<h3 style="color:red; font-size:25px;">INSERT INTO name (col_1_nam) VALUES (col_1_value)</h3>

In [21]:
query = """
    INSERT INTO mydb.users (username,study)
    VALUES ('usr2@xyz','SE')
"""
cursor.execute(query)

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Fill only username and study</div>

In [22]:
show_data()

username : usr1@xyz
user_id : 1
age : 16
study : CS
semister : 3

username : usr2@xyz
user_id : 2
age : None
study : SE
semister : None

<div style="text-align:left; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<br>
<h3 style="color:#005bbd; font-size:25px;">Insert  Values with change order
</h3><br>
<h3 style="color:red; font-size:25px;">INSERT INTO name (col_2,col_1) VALUES (col_2_value,col_1_value)</h3>

In [23]:
query = """
    INSERT INTO mydb.users (semister,username)
    VALUES (4,'ali12@xyz')
"""
cursor.execute(query)

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Fill only semister and username</div>

In [24]:
show_data()

username : usr1@xyz
user_id : 1
age : 16
study : CS
semister : 3

username : usr2@xyz
user_id : 2
age : None
study : SE
semister : None

username : ali12@xyz
user_id : 3
age : None
study : None
semister : 4

<div style="text-align:left; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<br>
<h3 style="color:#005bbd; font-size:25px;">Insert  Values without Define columns
</h3><br>
<h3 style="color:red; font-size:25px;">INSERT INTO name VALUES (col_1_value,col_2_value,col_2_value...)</h3>

In [27]:
query = """
    INSERT INTO mydb.users
    VALUES ('Rizwan223@xyz',99,18,'BSC',5)
"""
cursor.execute(query)

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">here 4 values username,user_id,age,study,semister<br>if we not define the columns than values filled with Default Order</div>

In [28]:
show_data()

username : usr1@xyz
user_id : 1
age : 16
study : CS
semister : 3

username : usr2@xyz
user_id : 2
age : None
study : SE
semister : None

username : ali12@xyz
user_id : 3
age : None
study : None
semister : 4

username : Rizwan223@xyz
user_id : 99
age : 18
study : BSC
semister : 5

In [29]:
clear_data()

<div style="text-align:left; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<br>
<h3 style="color:#005bbd; font-size:25px;">Insert  Multiples Values
</h3><br>
<h3 style="color:red; font-size:25px; line-height:200%;">INSERT INTO name(columns)<br>VALUES<br>(values),(values)...</h3>

In [60]:
query = """
    INSERT INTO mydb.users (username,age,study,semister)
    VALUES 
    ('Rizwan223@xyz',18,'BSC',5) ,
    ('ali2@xyz',20,'MSC',3),
    ('ahsan@xyz',25,'CS',2)
"""
cursor.execute(query)

In [61]:
show_data()

username : Rizwan223@xyz
user_id : 4
age : 18
study : BSC
semister : 5

username : ali2@xyz
user_id : 5
age : 20
study : MSC
semister : 3

username : ahsan@xyz
user_id : 6
age : 25
study : CS
semister : 2

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">UPDATE</h1>

<div style="text-align:left; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<br>
<h3 style="color:#005bbd; font-size:25px;">Update All Values
</h3><br>
<h3 style="color:red; font-size:25px;">UPDATE tablename SET col_1='new_value'</h3>

In [62]:
query = """
    UPDATE mydb.users
    SET semister=4
"""
cursor.execute(query)

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">All semisters values are updated</div>

In [63]:
show_data()

username : Rizwan223@xyz
user_id : 4
age : 18
study : BSC
semister : 4

username : ali2@xyz
user_id : 5
age : 20
study : MSC
semister : 4

username : ahsan@xyz
user_id : 6
age : 25
study : CS
semister : 4

<div style="text-align:left; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<br>
<h3 style="color:#005bbd; font-size:25px;">Update specfic Values With condition
</h3><br>
<h3 style="color:red; font-size:25px;">UPDATE tablename SET col_1='new_value' WHERE col condition</h3>

In [64]:
query = """
    UPDATE mydb.users
    SET age=30
    WHERE study = 'MSC'
    
"""
cursor.execute(query)

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">only update age wheres semister is MSC</div>

In [65]:
show_data()

username : Rizwan223@xyz
user_id : 4
age : 18
study : BSC
semister : 4

username : ali2@xyz
user_id : 5
age : 30
study : MSC
semister : 4

username : ahsan@xyz
user_id : 6
age : 25
study : CS
semister : 4

<div style="text-align:left; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<br>
<h3 style="color:#005bbd; font-size:25px;">Update specfic Values With Multiples condition
</h3><br>
<h3 style="color:red; font-size:25px;">UPDATE tablename SET col_1='new_value' WHERE col condition AND col condition</h3>

In [66]:
query = """
    UPDATE mydb.users
    SET semister = 6
    WHERE (semister = 4) AND (age >= 18) AND (age < 30)
"""
cursor.execute(query)

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">only change values who's semister is 4 , age >= 18 and age < 20</div>

In [67]:
show_data()

username : Rizwan223@xyz
user_id : 4
age : 18
study : BSC
semister : 6

username : ali2@xyz
user_id : 5
age : 30
study : MSC
semister : 4

username : ahsan@xyz
user_id : 6
age : 25
study : CS
semister : 6

<div style="text-align:left; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<br>
<h3 style="color:#005bbd; font-size:25px;">Update Multiple columns Values
</h3><br>
<h3 style="color:red; font-size:25px;">UPDATE tablename SET col1='value',col2='value' ..</h3>

In [68]:
query = """
    UPDATE mydb.users
    SET 
    age = 16,
    study = 'CS',
    semister = 0
    
"""
cursor.execute(query)

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">here update age,study,semister only bcz user_id and username are unqiues</div>

In [76]:
show_data()

username : Rizwan223@xyz
user_id : 4
age : 16
study : CS
semister : 0

username : ali2@xyz
user_id : 5
age : 16
study : CS
semister : 0

username : ahsan@xyz
user_id : 6
age : 16
study : CS
semister : 0

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">DELETE</h1>

<div style="text-align:left; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<br>
<h3 style="color:#005bbd; font-size:25px;">DELETE specfic Values With condition
</h3><br>
<h3 style="color:red; font-size:25px;">DELETE FROM tablename col_1 WHERE col condition</h3>

In [79]:
query = """
    DELETE FROM mydb.users
    WHERE username='Rizwan223@xyz'
"""
cursor.execute(query)

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Delete data where username is Rizwan223@xyz</div>

In [80]:
show_data()

username : ali2@xyz
user_id : 5
age : 16
study : CS
semister : 0

username : ahsan@xyz
user_id : 6
age : 16
study : CS
semister : 0

<div style="text-align:left; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<br>
<h3 style="color:#005bbd; font-size:25px;">DELETE specfic Values With multiple condition
</h3><br>
<h3 style="color:red; font-size:25px;">DELETE FROM tablename col_1 WHERE col = condition AND col = condition</h3>

In [81]:
query = """
    DELETE FROM mydb.users
    WHERE age = 16 AND user_id = 6
"""
cursor.execute(query)

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Delete data where age is 16 and user_id is 6</div>

In [82]:
show_data()

username : ali2@xyz
user_id : 5
age : 16
study : CS
semister : 0

<hr>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Commands

<ul>INSERT INTO name (columns..) VALUES (values..)</ul>
<ul>INSERT INTO name (col_1_nam) VALUES (col_1_value)</ul>
<ul>INSERT INTO name (col_2,col_1) VALUES (col_2_value,col_1_value)</ul>
<ul>INSERT INTO name VALUES (col_1_value,col_2_value,col_2_value...)</ul>
<ul>INSERT INTO name(columns)<br>VALUES<br>(values),(values)...</ul>
<br><br>
<ul>UPDATE tablename SET col_1='new_value'</ul>
<ul>UPDATE tablename SET col_1='new_value' WHERE col condition</ul>
<ul>UPDATE tablename SET col_1='new_value' WHERE col condition AND col condition</ul>
<ul>UPDATE tablename SET col1='value',col2='value' ..</ul>
<br><br>
<ul>DELETE FROM tablename col_1 WHERE col condition</ul>
<ul>DELETE FROM tablename col_1 WHERE col = condition AND col = condition</ul>
</div>